app/views/layouts/_extra.html.erb

SELECT "quotes".* FROM "quotes" LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "quotes"
---
              <i>
                <%= Quote.first(:offset => rand(Quote.count)).quote %>